rx-ted/cmsis-dap-stm32f103c6t6/src/config/DAP_config.h
/// Indicate that UART Serial Wire Output (SWO) trace is available.
/// This information is returned by the command \ref DAP_Info as part of <b>Capabilities</b>.
#define SWO_UART                0       ///< SWO UART:  1 = available, 0 = not available.

/// Maximum SWO UART Baudrate.
#define SWO_UART_MAX_BAUDRATE   1000000U  ///< 1MHz, SWO UART Maximum Baudrate in Hz.

/// Indicate that Manchester Serial Wire Output (SWO) trace is available.
/// This information is returned by the command \ref DAP_Info as part of <b>Capabilities</b>.
/// This function not ready in SWO.c !!!!!, should be 0 = (not available)
#define SWO_MANCHESTER          0       ///< SWO Manchester:  1 = available, 0 = not available.

/// SWO Trace Buffer Size.
#define SWO_BUFFER_SIZE         4096U   ///< SWO Trace Buffer Size in bytes (must be 2^n).

/// SWO Streaming Trace.
#define SWO_STREAM              0       ///< SWO Streaming Trace: 1 = available, 0 = not available.

/// Clock frequency of the Test Domain Timer. Timer value is returned with \ref TIMESTAMP_GET.
#define TIMESTAMP_CLOCK         SystemCoreClock ///< 72MHz, Timestamp clock in Hz (0 = timestamps not supported).

/// Debug Unit is connected to fixed Target Device.
/// The Debug Unit may be part of an evaluation board and always connected to a fixed
/// known device.  In this case a Device Vendor and Device Name string is stored which
/// may be used by the debugger or IDE to configure device parameters.
#define TARGET_DEVICE_FIXED     0       ///< Target Device: 1 = known, 0 = unknown;

#if TARGET_DEVICE_FIXED
#define TARGET_DEVICE_VENDOR    ""    ///< String indicating the Silicon Vendor
#define TARGET_DEVICE_NAME      ""    ///< String indicating the Target Device
#endif

///@}

#if defined ( BOARD_C6 )
#define GPIO_INIT(port, pinmask, mode, speed) \
  { GPIO_ConfigPin(port, (pinmask), (mode), (speed)); }
#else
#define GPIO_INIT(port, data) GPIO_Init(port, (GPIO_InitTypeDef *)&data)
#endif
#define PIN_MODE_MASK(pin)    (((uint32_t)0x0F) << ((pin) << 2))
#define PIN_MODE(mode,pin)    (((uint32_t)mode) << ((pin) << 2))
#define PIN_MASK(pin)         (((uint16_t)0x01) << (pin))

typedef enum Pin_e {
  PA = 0x00, PA0 = 0x00, PA1, PA2, PA3, PA4, PA5, PA6, PA7, PA8, PA9, PA10, PA11, PA12, PA13, PA14, PA15,
  PB = 0x10, PB0 = 0x10, PB1, PB2, PB3, PB4, PB5, PB6, PB7, PB8, PB9, PB10, PB11, PB12, PB13, PB14, PB15,
  PC = 0x20, PC0 = 0x20, PC1, PC2, PC3, PC4, PC5, PC6, PC7, PC8, PC9, PC10, PC11, PC12, PC13, PC14, PC15,
  PD = 0x30, PD0 = 0x30, PD1, PD2,
} Pin_t;

// USART1 for CDC Port
// BOARD_C6 uses USART1 (PA9 TX / PA10 RX) for the CDC virtual serial port

#if defined ( BOARD_C6 )
#define USART_CDC_CLOCK(state)      RCC->APB2ENR |= RCC_APB2ENR_USART1EN
#define USART_CDC_GPIO_CLOCK(state) RCC->APB2ENR |= RCC_APB2ENR_IOPAEN
#define USART_CDC_REMAP()           /* no remap needed on C6 */
#else
#define USART_CDC_CLOCK(state)      RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, state)
#define USART_CDC_GPIO_CLOCK(state) RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, state)
#define USART_CDC_REMAP()           /* GPIO_PinRemapConfig(..., ENABLE) */
#endif

#if defined ( BOARD_C6 )
#define USART_CDC_PORT        1     //USART1
#define USART_CDC_GPIO        GPIOA
#define USART_CDC_TX_PIN_MASK (1U << 9)
#define USART_CDC_RX_PIN_MASK (1U << 10)
#else
#define USART_CDC_PORT        2     //USART2
#define USART_CDC_GPIO        GPIOA
#define USART_CDC_TX_PIN_MASK GPIO_Pin_2
#define USART_CDC_RX_PIN_MASK GPIO_Pin_3
#endif
#define USART_CDC_IRQn        USART1_IRQn
#define USART_CDC_IRQHandler  USART1_IRQHandler
#define USART_CDC_BUFFER_SIZE (512)  /*  Size of Receive and Transmit buffers MUST BE 2^n */

// USB Connect Pull-Up

#if defined ( BOARD_C6 )

// USB Connect Pull-Up on C6 board: PA12 has a fixed 3.3V pull-up, no software
// control pin available. USB is always active when the board is powered.
#define PIN_USB_CONNECT_ON()
#define PIN_USB_CONNECT_OFF()

#elif   defined ( BLUEPILL ) \
  ||  defined ( BOARD_V1 ) \
  ||  defined ( BOARD_V2 )

#define PIN_USB_CONNECT_RCC   RCC_APB2ENR_IOPAEN
#define PIN_USB_CONNECT_PORT  GPIOA
#define PIN_USB_CONNECT_PIN   8
#define PIN_USB_CONNECT_MASK  PIN_MASK(PIN_USB_CONNECT_PIN)
#define PIN_USB_MODE          GPIO_Mode_Out_PP
#define PIN_USB_CONNECT_ON()  PIN_USB_CONNECT_PORT->BSRR = PIN_USB_CONNECT_MASK
#define PIN_USB_CONNECT_OFF() PIN_USB_CONNECT_PORT->BRR  = PIN_USB_CONNECT_MASK

#elif  defined ( STLINK_V20 ) \
  ||   defined ( STLINK_V2A ) \
  ||   defined ( STLINK_V2B )

#define PIN_USB_CONNECT_ON()
#define PIN_USB_CONNECT_OFF()

#elif defined ( STLINK_V21 )

#define PIN_USB_CONNECT_RCC   RCC_APB2ENR_IOPAEN
#define PIN_USB_CONNECT_PORT  GPIOA
#define PIN_USB_CONNECT_PIN   15
#define PIN_USB_CONNECT_MASK  PIN_MASK(PIN_USB_CONNECT_PIN)
#define PIN_USB_MODE          GPIO_Mode_Out_OD
#define PIN_USB_CONNECT_ON()  PIN_USB_CONNECT_PORT->BSRR = PIN_USB_CONNECT_MASK
#define PIN_USB_CONNECT_OFF() PIN_USB_CONNECT_PORT->BRR  = PIN_USB_CONNECT_MASK

#elif defined ( BOARD_STM32RF )

// USB Connect Pull-Up
#define PIN_USB_CONNECT_RCC   RCC_APB2ENR_IOPBEN
#define PIN_USB_CONNECT_PORT  GPIOB
#define PIN_USB_CONNECT_PIN   5
#define PIN_USB_CONNECT_MASK  PIN_MASK(PIN_USB_CONNECT_PIN)
#define PIN_USB_MODE          GPIO_Mode_Out_PP
#define PIN_USB_CONNECT_ON()  PIN_USB_CONNECT_PORT->BSRR = PIN_USB_CONNECT_MASK
#define PIN_USB_CONNECT_OFF() PIN_USB_CONNECT_PORT->BRR  = PIN_USB_CONNECT_MASK
#endif

#if defined ( BLUEPILL )              //New STM32F103C8T6 - Bluepill Board

#if defined ( SWD_REMAP )             //remap SWDIO/SWCLK to PA13/PA14

// TDI Pin (output)
#define PIN_TDI_PORT        GPIOB
#define PIN_TDI_PIN         5

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOA   //remapped
#define PIN_SWDIO_TMS_PIN   13

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOA   //remapped
#define PIN_SWCLK_TCK_PIN   14

// TDO/SWO Pin (input)              //remap USART1_Rx_Pin to PB7 for SWO
#define PIN_TDO_PORT        GPIOB
#define PIN_TDO_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOB
#define PIN_nRESET_PIN      6

#else //#if defined ( SWD_REMAP )

