rx-ted/cmsis-dap-stm32f103c6t6/src/config/DAP_config.h
// TDI Pin (output)
#define PIN_TDI_PORT        GPIOB
#define PIN_TDI_PIN         5

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOB
#define PIN_SWDIO_TMS_PIN   9

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOB
#define PIN_SWCLK_TCK_PIN   8

// TDO/SWO Pin (input)              //remap USART1_Rx_Pin to PB7 for SWO
#define PIN_TDO_PORT        GPIOB
#define PIN_TDO_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOB
#define PIN_nRESET_PIN      6

#endif //#if defined ( SWD_REMAP )

#elif defined ( BOARD_C6 )

// SWDIO/TMS Pin (PA2)
#define PIN_SWDIO_TMS_PORT  GPIOA
#define PIN_SWDIO_TMS_PIN   2

// SWCLK/TCK Pin (PA4)
#define PIN_SWCLK_TCK_PORT  GPIOA
#define PIN_SWCLK_TCK_PIN   4

// nRESET Pin (PA6)
#define PIN_nRESET_PORT     GPIOA
#define PIN_nRESET_PIN      6

// TDI/TDO Pins. Default BOARD_C6: reuse USART1 pins PA9/PA10:
// PA9 (TX, output) -> TDI, PA10 (RX, input) -> TDO. Same pins as the
// CDC serial bridge; CDC_JTAG_SWITCH selects between both at runtime.
#define PIN_TDI_PORT        GPIOA
#define PIN_TDI_PIN         9
#define PIN_TDO_PORT        GPIOA
#define PIN_TDO_PIN         10

#if (CDC_JTAG_SWITCH != 0)
/* Keep the shared PA9/PA10 pins assigned to JTAG while the host is
   active; the 2 s idle timeout in hw_config.c reverts them to CDC. */
extern void JTAG_Port_Activity(void);
#define DAP_JTAG_ACTIVITY() JTAG_Port_Activity()
#endif

// Debug Unit Identification (returned by DAP_Info)
// The serial number is generated at run time from the 96-bit chip unique ID.
#define DAP_VENDOR          "ARM"
#define DAP_PRODUCT         "CMSIS-DAP-C6"
#define DAP_SER_NUM         "0000"    // placeholder, overwritten by DAP_SER_NUM_INIT
#define DAP_SER_NUM_LEN     11        // "C6" + 8 hex digits + NUL
extern const char *GetUID_String(void);
#define DAP_SER_NUM_INIT(dst) strcpy((dst), GetUID_String())

#elif defined ( BOARD_V1 )

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOA
#define PIN_SWDIO_TMS_PIN   0         //PA2 conflict with USART2
//#error "PA2 conflict with USART2, Please remove USART-CDC function or change PIN_SWDIO_TMS_PIN!!!!"

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOA
#define PIN_SWCLK_TCK_PIN   4

// TDO/SWO Pin (input)
#define PIN_TDO_PORT        GPIOA
#define PIN_TDO_PIN         5

// TDI Pin (output)
#define PIN_TDI_PORT        GPIOA
#define PIN_TDI_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOA
#define PIN_nRESET_PIN      6

#elif defined ( BOARD_V2 )

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOA
#define PIN_SWDIO_TMS_PIN   4

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOA
#define PIN_SWCLK_TCK_PIN   5

// TDO/SWO Pin (input)
#define PIN_TDO_PORT        GPIOA
#define PIN_TDO_PIN         6

// TDI Pin (output)
#define PIN_TDI_PORT        GPIOA
#define PIN_TDI_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOB
#define PIN_nRESET_PIN      9

#elif defined ( STLINK_V20 ) \
   || defined ( STLINK_V21 )

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOB
#define PIN_SWDIO_TMS_PIN   14

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOB
#define PIN_SWCLK_TCK_PIN   13

// TDO/SWO Pin (input)
#define PIN_TDO_PORT        GPIOB
#define PIN_TDO_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOB
#define PIN_nRESET_PIN      0

#elif defined ( BOARD_STM32RF )

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOA
#define PIN_SWDIO_TMS_PIN   6

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOA
#define PIN_SWCLK_TCK_PIN   7

// TDO/SWO Pin (input)

#define PIN_TDO_PORT        GPIOB
#define PIN_TDO_PIN         7

// nRESET Pin
#define PIN_nRESET_PORT     GPIOB
#define PIN_nRESET_PIN      9

#elif defined ( STLINK_V2A ) \
  ||  defined ( STLINK_V2B )

// SWDIO/TMS Pin
#define PIN_SWDIO_TMS_PORT  GPIOB
#define PIN_SWDIO_TMS_PIN   14

// SWCLK/TCK Pin
#define PIN_SWCLK_TCK_PORT  GPIOB
#define PIN_SWCLK_TCK_PIN   13

// TDO/SWO Pin (input)
#define PIN_TDO_PORT        GPIOA
#define PIN_TDO_PIN         10

// TDI Pin (output), STLINK_V2B use only
#define PIN_TDI_PORT        GPIOB
#define PIN_TDI_PIN         8

// nRESET Pin
#define PIN_nRESET_PORT     GPIOB
#define PIN_nRESET_PIN      6

#endif

// Debug Unit LEDs
#if defined ( BLUEPILL )

#define LED_CONNECTED_RCC   RCC_APB2ENR_IOPCEN //PC13 - Bluepill
#define LED_CONNECTED_PORT  GPIOC
#define LED_CONNECTED_PIN   13

#define LED_RUNNING_RCC     RCC_APB2ENR_IOPCEN //PC13 - Bluepill
#define LED_RUNNING_PORT    GPIOC
#define LED_RUNNING_PIN     13

#elif defined ( BOARD_C6 )

#define LED_CONNECTED_RCC   RCC_APB2ENR_IOPBEN
#define LED_RUNNING_RCC     RCC_APB2ENR_IOPBEN

// Connected LED (PB8)
#define LED_CONNECTED_PORT  GPIOB
#define LED_CONNECTED_PIN   12

// Target Running LED (PB12)
#define LED_RUNNING_PORT    GPIOB
#define LED_RUNNING_PIN     8

#elif defined ( BOARD_V1 ) || defined ( BOARD_V2 )

#define LED_CONNECTED_RCC   RCC_APB2ENR_IOPBEN
#define LED_RUNNING_RCC     RCC_APB2ENR_IOPBEN

// Connected LED (GREEN)
#define LED_CONNECTED_PORT  GPIOB
#define LED_CONNECTED_PIN   13

// Target Running LED (RED)
#define LED_RUNNING_PORT    GPIOB
#define LED_RUNNING_PIN     12

#elif defined ( STLINK_V20 ) \
  ||  defined ( STLINK_V2A ) \
  ||  defined ( STLINK_V2B )

#define LED_CONNECTED_RCC   RCC_APB2ENR_IOPAEN
#define LED_RUNNING_RCC     RCC_APB2ENR_IOPAEN

// Connected LED (GREEN)  0
// Target Running LED (RED) 1
// Off - float
#define LED_CONNECTED_PORT  GPIOA
#define LED_CONNECTED_PIN   9

#define LED_RUNNING_PORT    GPIOA
#define LED_RUNNING_PIN     9

#elif defined ( STLINK_V21 )

#define LED_CONNECTED_RCC   RCC_APB2ENR_IOPAEN
#define LED_RUNNING_RCC     RCC_APB2ENR_IOPAEN

// Connected LED (GREEN)  0
// Target Running LED (RED) 1
// Off - float
#define LED_CONNECTED_PORT  GPIOA
#define LED_CONNECTED_PIN   9

#define LED_RUNNING_PORT    GPIOA
#define LED_RUNNING_PIN     8

//  #define LED_CONNECTED_MASK  PIN_MASK(LED_CONNECTED_PIN)
//  #define LED_RUNNING_MASK    PIN_MASK(LED_RUNNING_PIN)

#elif defined ( BOARD_STM32RF )

#define LED_CONNECTED_RCC   RCC_APB2ENR_IOPBEN
#define LED_RUNNING_RCC     RCC_APB2ENR_IOPBEN

// Connected LED (GREEN)
#define LED_CONNECTED_PORT  GPIOB
#define LED_CONNECTED_PIN   11

// Target Running LED (RED)
#define LED_RUNNING_PORT    GPIOB
#define LED_RUNNING_PIN     12

#endif

#define LED_CONNECTED_MASK      PIN_MASK(LED_CONNECTED_PIN)
#define LED_RUNNING_MASK        PIN_MASK(LED_RUNNING_PIN)

#define PIN_nRESET_MASK         PIN_MASK(PIN_nRESET_PIN)
#define PIN_SWDIO_TMS_MASK      PIN_MASK(PIN_SWDIO_TMS_PIN)
#define PIN_SWCLK_TCK_MASK      PIN_MASK(PIN_SWCLK_TCK_PIN)
#define PIN_TDI_MASK            PIN_MASK(PIN_TDI_PIN)
#define PIN_TDO_MASK            PIN_MASK(PIN_TDO_PIN)

#if (PIN_nRESET_PIN >= 8)
#define PIN_nRESET_LOW()              \
  do {                      \
    /* output open-drain 50MHz, register mode = 0x07 */ \
    PIN_nRESET_PORT->CRH = (PIN_nRESET_PORT->CRH & ~PIN_MODE_MASK(PIN_nRESET_PIN - 8))  \
    | PIN_MODE(0x07, PIN_nRESET_PIN - 8); \
    PIN_nRESET_PORT->BRR = PIN_nRESET_MASK; \
  } while (0)

